app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @product = Product.new(product_params)
      if @product.save

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "49.99"], ["updated_at", "2024-05-26 20:44:27.851890"], ["id", 1]]
---
    def update
      if @product.update(product_params)